package project.태민;

public class 도서정보 {

	public static void main(String[] args) {
		
		정보[] 도서정보 = new 정보[50];
		도서정보[0] = new 정보("새들이 울었던 자리가 있다", "주희", "해움");
		도서정보[1] = new 정보("마음이 살짝 기운다", "나태주", "알에이치케이");
		도서정보[2] = new 정보("아버지도 나를 슬퍼했다", "김지훈", "꿈공장");
		도서정보[3] = new 정보("아버지도 나를 슬퍼했다", "김지훈", "꿈공장");
		도서정보[4] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[5] = new 정보("꽃을 보듯 너를 본다", "나태주", "지혜");
		도서정보[6] = new 정보("하얼빈", "김훈", "문학동네");
		도서정보[7] = new 정보("모순", "양귀자", "쓰다");
		도서정보[8] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[9] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[10] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[11] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[12] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[13] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[14] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[15] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[16] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[17] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[18] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[19] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[20] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[21] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[22] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[23] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[24] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[25] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[26] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[27] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[28] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[29] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[30] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[31] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[32] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[33] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[34] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[35] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[36] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[37] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[38] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[39] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[40] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[41] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[42] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[43] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[44] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[45] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[46] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[47] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[48] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		도서정보[49] = new 정보("하늘과 별과 바람과 시", "윤동주", "오늘부터출판사");
		
		
		System.out.println( "m0=" + 도서정보[0]);
		System.out.println( "m1=" + 도서정보[1]);
		System.out.println( "m2=" + 도서정보[2]);
		System.out.println( "m3=" + 도서정보[3]);
		System.out.println( "m4=" + 도서정보[4]);
		
		System.out.println(  "m2"+ 도서정보[49]);
		
		
		정렬메서드.sort(도서정보);
		
		
		/*for(정보 b : 도서정보) {
			System.out.println(b);
		}
		
		*/
	}

}
